ARMmbed/mbed-os/targets/TARGET_Silicon_Labs/TARGET_EFM32/spi_api.c
/***************************************************************************//**
 * @file spi_api.c
 *******************************************************************************
 * @section License
 * <b>(C) Copyright 2015 Silicon Labs, http://www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License"); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/

#include "device.h"
#include "clocking.h"
#if DEVICE_SPI

#include "mbed_assert.h"
#include "PeripheralPins.h"
#include "pinmap.h"
#include "pinmap_function.h"
#include "mbed_error.h"

#include "dma_api.h"
#include "dma_api_HAL.h"
#include "serial_api_HAL.h"
#include "spi_api.h"
#include "em_usart.h"
#include "em_cmu.h"
#include "em_dma.h"

static uint16_t fill_word = SPI_FILL_WORD;

static inline CMU_Clock_TypeDef spi_get_clock_tree(spi_t *obj)
{
    switch ((int)obj->spi.spi) {
#ifdef USART0
        case SPI_0:
            return cmuClock_USART0;
#endif
#ifdef USART1
        case SPI_1:
            return cmuClock_USART1;
#endif
#ifdef USART2
        case SPI_2:
            return cmuClock_USART2;
#endif
#ifdef USART3
        case SPI_3:
            return cmuClock_USART3;
#endif
#ifdef USART4
        case SPI_4:
            return cmuClock_USART4;
#endif
#ifdef USART5
        case SPI_5:
            return cmuClock_USART5;
#endif
        default:
            error("Spi module not available.. Out of bound access.");
            return cmuClock_HFPER;
    }
}

static inline uint8_t spi_get_index(spi_t *obj)
{
    uint8_t index = 0;
    switch ((int)obj->spi.spi) {
#ifdef USART0
        case SPI_0:
            index = 0;
            break;
#endif
#ifdef USART1
        case SPI_1:
            index = 1;
            break;
#endif
#ifdef USART2
        case SPI_2:
            index = 2;
            break;
#endif
#ifdef USART3
        case SPI_3:
            index = 3;
            break;
#endif
#ifdef USART4
        case SPI_4:
            index = 4;
            break;
#endif
#ifdef USART5
        case SPI_5:
            index = 5;
            break;
#endif
        default:
            error("Spi module not available.. Out of bound access.");
            break;
    }
    return index;
}

uint8_t spi_get_module(spi_t *obj)
{
    return spi_get_index(obj);
}

static void usart_init(spi_t *obj, uint32_t baudrate, USART_Databits_TypeDef databits, bool master, USART_ClockMode_TypeDef clockMode )
{
    USART_InitSync_TypeDef init = USART_INITSYNC_DEFAULT;
    init.enable = usartDisable;
    init.baudrate = baudrate;
    init.databits = databits;
    init.master = master;
    init.msbf   = 1;
    init.clockMode = clockMode;

    /* Determine the reference clock, because the correct clock may not be set up at init time (e.g. before main()) */
    init.refFreq = REFERENCE_FREQUENCY;

    USART_InitSync(obj->spi.spi, &init);
}

void spi_enable(spi_t *obj, uint8_t enable)
{
    USART_Enable(obj->spi.spi, (enable ? usartEnable : usartDisable));
}

void spi_init_direct(spi_t *obj, explicit_pinmap_t *explicit_pinmap)
{
    CMU_ClockEnable(cmuClock_HFPER, true);

    obj->spi.spi = (USART_TypeDef *) explicit_pinmap->peripheral;
    MBED_ASSERT((unsigned int) obj->spi.spi != NC);

    if (explicit_pinmap->pin[3] != NC) { /* Slave mode */
        obj->spi.master = false;
    } else {
        obj->spi.master = true;
    }

#if defined(_SILICON_LABS_32B_PLATFORM_1)
    // On P1, we need to ensure all pins are on same location
    uint32_t loc_mosi = explicit_pinmap->function[0];
    uint32_t loc_miso = explicit_pinmap->function[1];
    uint32_t loc_clk = explicit_pinmap->function[2];
    uint32_t loc_cs = explicit_pinmap->function[3];
    uint32_t loc_data = pinmap_merge(loc_mosi, loc_miso);
    uint32_t loc_ctrl = pinmap_merge(loc_clk, loc_cs);
    obj->spi.location = pinmap_merge(loc_data, loc_ctrl);
    MBED_ASSERT(obj->spi.location != NC);
#endif

    obj->spi.dmaOptionsTX.dmaUsageState = DMA_USAGE_OPPORTUNISTIC;

    CMU_ClockEnable(spi_get_clock_tree(obj), true);
    usart_init(obj, 100000, usartDatabits8, true, usartClockMode0);

    if (obj->spi.master) { /* Master mode */
        /* Either mosi or miso can be NC */
        if (explicit_pinmap->pin[0] != NC) {
            pin_mode(explicit_pinmap->pin[0], PushPull);
        }
        if (explicit_pinmap->pin[1] != NC) {
            pin_mode(explicit_pinmap->pin[1], Input);
        }
        pin_mode(explicit_pinmap->pin[2], PushPull);
        /* Don't set cs pin, since we toggle it manually */
    } else { /* Slave mode */
        if (explicit_pinmap->pin[0] != NC) {
            pin_mode(explicit_pinmap->pin[0], Input);
        }
        if (explicit_pinmap->pin[1] != NC) {
            pin_mode(explicit_pinmap->pin[1], PushPull);
        }
        pin_mode(explicit_pinmap->pin[2], Input);
        pin_mode(explicit_pinmap->pin[3], Input);
    }

    /* Enabling pins and setting location */
#ifdef _USART_ROUTEPEN_RESETVALUE
    uint32_t route = USART_ROUTEPEN_CLKPEN;

    obj->spi.spi->ROUTELOC0 &= ~_USART_ROUTELOC0_CLKLOC_MASK;
    obj->spi.spi->ROUTELOC0 |= pin_location(explicit_pinmap->pin[2], PinMap_SPI_CLK)<<_USART_ROUTELOC0_CLKLOC_SHIFT;
    if (explicit_pinmap->pin[0] != NC) {
        route |= USART_ROUTEPEN_TXPEN;
        obj->spi.spi->ROUTELOC0 &= ~_USART_ROUTELOC0_TXLOC_MASK;
        obj->spi.spi->ROUTELOC0 |= pin_location(explicit_pinmap->pin[0], PinMap_SPI_MOSI)<<_USART_ROUTELOC0_TXLOC_SHIFT;
    }
    if (explicit_pinmap->pin[1] != NC) {
        route |= USART_ROUTEPEN_RXPEN;
        obj->spi.spi->ROUTELOC0 &= ~_USART_ROUTELOC0_RXLOC_MASK;
        obj->spi.spi->ROUTELOC0 |= pin_location(explicit_pinmap->pin[1], PinMap_SPI_MISO)<<_USART_ROUTELOC0_RXLOC_SHIFT;
    }
    if (!obj->spi.master) {
        route |= USART_ROUTEPEN_CSPEN;
        obj->spi.spi->ROUTELOC0 &= ~_USART_ROUTELOC0_CSLOC_MASK;
        obj->spi.spi->ROUTELOC0 |= pin_location(explicit_pinmap->pin[3], PinMap_SPI_CS)<<_USART_ROUTELOC0_CSLOC_SHIFT;
    }
    obj->spi.location = obj->spi.spi->ROUTELOC0;
    obj->spi.route = route;
    obj->spi.spi->ROUTEPEN = route;

#else
    uint32_t route = USART_ROUTE_CLKPEN;

    if (explicit_pinmap->pin[0] != NC) {
        route |= USART_ROUTE_TXPEN;
    }
    if (explicit_pinmap->pin[1] != NC) {
        route |= USART_ROUTE_RXPEN;
    }
    if (!obj->spi.master) {
        route |= USART_ROUTE_CSPEN;
    }
    route |= obj->spi.location << _USART_ROUTE_LOCATION_SHIFT;
    obj->spi.spi->ROUTE = route;
    obj->spi.route = route;

#endif

    spi_enable(obj, true);
}

void spi_init(spi_t *obj, PinName mosi, PinName miso, PinName sclk, PinName ssel)
{
    // determine the SPI to use
    uint32_t spi_mosi = pinmap_peripheral(mosi, PinMap_SPI_MOSI);
    uint32_t spi_miso = pinmap_peripheral(miso, PinMap_SPI_MISO);
    uint32_t spi_sclk = pinmap_peripheral(sclk, PinMap_SPI_CLK);
    uint32_t spi_ssel = pinmap_peripheral(ssel, PinMap_SPI_CS);
    uint32_t spi_data = pinmap_merge(spi_mosi, spi_miso);
    uint32_t spi_cntl = pinmap_merge(spi_sclk, spi_ssel);

