ARMmbed/mbed-os/targets/TARGET_Silicon_Labs/TARGET_EFM32/spi_api.c
    txChnlCfg.highPri   = false;
    txChnlCfg.enableInt = true;
    txChnlCfg.cb        = &(obj->spi.dmaOptionsTX.dmaCallback);

    switch ((int)obj->spi.spi) {
#ifdef USART0
        case SPI_0:
            rxChnlCfg.select = DMAREQ_USART0_RXDATAV;
            txChnlCfg.select = DMAREQ_USART0_TXEMPTY;
            break;
#endif
#ifdef USART1
        case SPI_1:
            rxChnlCfg.select = DMAREQ_USART1_RXDATAV;
            txChnlCfg.select = DMAREQ_USART1_TXEMPTY;
            break;
#endif
#ifdef USART2
        case SPI_2:
            rxChnlCfg.select = DMAREQ_USART2_RXDATAV;
            txChnlCfg.select = DMAREQ_USART2_TXEMPTY;
            break;
#endif
#ifdef USART3
        case SPI_3:
            rxChnlCfg.select = DMAREQ_USART3_RXDATAV;
            txChnlCfg.select = DMAREQ_USART3_TXEMPTY;
            break;
#endif
#ifdef USART4
        case SPI_4:
            rxChnlCfg.select = DMAREQ_USART4_RXDATAV;
            txChnlCfg.select = DMAREQ_USART4_TXEMPTY;
            break;
#endif
#ifdef USART5
        case SPI_5:
            rxChnlCfg.select = DMAREQ_USART5_RXDATAV;
            txChnlCfg.select = DMAREQ_USART5_TXEMPTY;
            break;
#endif
        default:
            error("Spi module not available.. Out of bound access.");
            break;
    }
    DMA_CfgChannel(obj->spi.dmaOptionsRX.dmaChannel, &rxChnlCfg);
    DMA_CfgChannel(obj->spi.dmaOptionsTX.dmaChannel, &txChnlCfg);
}
#endif // LDMA_PRESENT
/******************************************
* void spi_activate_dma(spi_t *obj, void* rxdata, void* txdata, int length)
*
* This function will start the DMA engine for SPI transfers
*
*   * rxdata: pointer to RX buffer, if needed.
*   * txdata: pointer to TX buffer, if needed. Else FF's.
*   * tx_length: how many bytes will get sent.
*   * rx_length: how many bytes will get received. If > tx_length, TX will get padded with n lower bits of SPI_FILL_WORD.
******************************************/
#ifdef LDMA_PRESENT
static void spi_activate_dma(spi_t *obj, void* rxdata, const void* txdata, int tx_length, int rx_length)
{
    LDMA_PeripheralSignal_t dma_periph;

    if(rxdata) {
        volatile const void *source_addr;
        /* Select RX source address. 9 bit frame length requires to use extended register.
           10 bit and larger frame requires to use RXDOUBLE register. */
        switch((int)obj->spi.spi) {
#ifdef USART0
            case USART_0:
                dma_periph = ldmaPeripheralSignal_USART0_RXDATAV;
                break;
#endif
#ifdef USART1
            case USART_1:
                dma_periph = ldmaPeripheralSignal_USART1_RXDATAV;
                break;
#endif
#ifdef USART2
            case USART_2:
                dma_periph = ldmaPeripheralSignal_USART2_RXDATAV;
                break;
#endif
#ifdef USART3
            case USART_3:
                dma_periph = ldmaPeripheralSignal_USART3_RXDATAV;
                break;
#endif
#ifdef USART4
            case USART_4:
                dma_periph = ldmaPeripheralSignal_USART4_RXDATAV;
                break;
#endif
#ifdef USART5
            case USART_5:
                dma_periph = ldmaPeripheralSignal_USART5_RXDATAV;
                break;
#endif
            default:
                EFM_ASSERT(0);
                while(1);
                break;
        }

        if (obj->spi.bits <= 8) {
            source_addr = &obj->spi.spi->RXDATA;
        } else if (obj->spi.bits == 9) {
            source_addr = &obj->spi.spi->RXDATAX;
        } else {
            source_addr = &obj->spi.spi->RXDOUBLE;
        }

        LDMA_TransferCfg_t xferConf = LDMA_TRANSFER_CFG_PERIPHERAL(dma_periph);
        LDMA_Descriptor_t desc = LDMA_DESCRIPTOR_SINGLE_P2M_BYTE(source_addr, rxdata, rx_length);

        if(obj->spi.bits >= 9){
            desc.xfer.size = ldmaCtrlSizeHalf;
        }

        if (obj->tx_buff.width == 32) {
            if (obj->spi.bits >= 9) {
                desc.xfer.dstInc = ldmaCtrlDstIncTwo;
            } else {
                desc.xfer.dstInc = ldmaCtrlDstIncFour;
            }
        } else if (obj->tx_buff.width == 16) {
            if (obj->spi.bits >= 9) {
                desc.xfer.dstInc = ldmaCtrlDstIncOne;
            } else {
                desc.xfer.dstInc = ldmaCtrlDstIncTwo;
            }
        } else {
            desc.xfer.dstInc = ldmaCtrlDstIncOne;
        }

        LDMAx_StartTransfer(obj->spi.dmaOptionsRX.dmaChannel, &xferConf, &desc, serial_dmaTransferComplete,obj->spi.dmaOptionsRX.dmaCallback.userPtr);
    }

    volatile void *target_addr;

    /* Select TX target address. 9 bit frame length requires to use extended register.
       10 bit and larger frame requires to use TXDOUBLE register. */
    switch ((int)obj->spi.spi) {
        case USART_0:
            dma_periph = ldmaPeripheralSignal_USART0_TXBL;
            break;
        case USART_1:
            dma_periph = ldmaPeripheralSignal_USART1_TXBL;
            break;
        default:
            EFM_ASSERT(0);
            while(1);
            break;
    }

    if (obj->spi.bits <= 8) {
        target_addr = &obj->spi.spi->TXDATA;
    } else if (obj->spi.bits == 9) {
        target_addr = &obj->spi.spi->TXDATAX;
    } else {
        target_addr = &obj->spi.spi->TXDOUBLE;
    }

    /*  Check the transmit length, and split long transfers to smaller ones */
    int max_length = 1024;
#ifdef _LDMA_CH_CTRL_XFERCNT_MASK
    max_length = (_LDMA_CH_CTRL_XFERCNT_MASK>>_LDMA_CH_CTRL_XFERCNT_SHIFT)+1;
#endif
    if (tx_length > max_length) {
        tx_length = max_length;
    }

    /* Save amount of TX done by DMA */
    obj->tx_buff.pos += tx_length;

    LDMA_TransferCfg_t xferConf = LDMA_TRANSFER_CFG_PERIPHERAL(dma_periph);
    LDMA_Descriptor_t desc = LDMA_DESCRIPTOR_SINGLE_M2P_BYTE((txdata ? txdata : &fill_word), target_addr, tx_length);

    if (obj->spi.bits >= 9) {
        desc.xfer.size = ldmaCtrlSizeHalf;
    }

    if (!txdata) {
        desc.xfer.srcInc = ldmaCtrlSrcIncNone;
    } else if (obj->tx_buff.width == 32) {
        if (obj->spi.bits >= 9) {
            desc.xfer.srcInc = ldmaCtrlSrcIncTwo;
        } else {
            desc.xfer.srcInc = ldmaCtrlSrcIncFour;
        }
    } else if (obj->tx_buff.width == 16) {
        if (obj->spi.bits >= 9) {
            desc.xfer.srcInc = ldmaCtrlSrcIncOne;
        } else {
            desc.xfer.srcInc = ldmaCtrlSrcIncTwo;
        }
    } else {
        desc.xfer.srcInc = ldmaCtrlSrcIncOne;
    }

    // Kick off DMA TX
    LDMAx_StartTransfer(obj->spi.dmaOptionsTX.dmaChannel, &xferConf, &desc, serial_dmaTransferComplete,obj->spi.dmaOptionsTX.dmaCallback.userPtr);
}

#else
/******************************************
* void spi_activate_dma(spi_t *obj, void* rxdata, void* txdata, int length)
*
* This function will start the DMA engine for SPI transfers
*
*   * rxdata: pointer to RX buffer, if needed.
*   * txdata: pointer to TX buffer, if needed. Else FF's.
*   * tx_length: how many bytes will get sent.
*   * rx_length: how many bytes will get received. If > tx_length, TX will get padded with n lower bits of SPI_FILL_WORD.
******************************************/
static void spi_activate_dma(spi_t *obj, void* rxdata, const void* txdata, int tx_length, int rx_length)
{
    /* DMA descriptors */
    DMA_CfgDescr_TypeDef rxDescrCfg;
    DMA_CfgDescr_TypeDef txDescrCfg;

