ARMmbed/mbed-os/targets/TARGET_Silicon_Labs/TARGET_EFM32/spi_api.c
    /* Split up transfers if the length is larger than what the DMA supports. */
    const int DMA_MAX_TRANSFER = (_DMA_CTRL_N_MINUS_1_MASK >> _DMA_CTRL_N_MINUS_1_SHIFT);

    if (tx_length > DMA_MAX_TRANSFER) {
        tx_length = DMA_MAX_TRANSFER;
    }
    if (rx_length > DMA_MAX_TRANSFER) {
        rx_length = DMA_MAX_TRANSFER;
    }

    /* Save amount of TX done by DMA */
    obj->tx_buff.pos += tx_length;
    obj->rx_buff.pos += rx_length;

    /* Only activate RX DMA if a receive buffer is specified */
    if (rxdata != NULL) {
        // Setting up channel descriptor
        if (obj->rx_buff.width == 32) {
            rxDescrCfg.dstInc = dmaDataInc4;
        } else if (obj->rx_buff.width == 16) {
            rxDescrCfg.dstInc = dmaDataInc2;
        } else {
            rxDescrCfg.dstInc = dmaDataInc1;
        }
        rxDescrCfg.srcInc = dmaDataIncNone;
        rxDescrCfg.size = (obj->spi.bits <= 8 ? dmaDataSize1 : dmaDataSize2); //When frame size >= 9, use RXDOUBLE
        rxDescrCfg.arbRate = dmaArbitrate1;
        rxDescrCfg.hprot = 0;
        DMA_CfgDescr(obj->spi.dmaOptionsRX.dmaChannel, true, &rxDescrCfg);

        void * rx_reg;
        if (obj->spi.bits > 9) {
            rx_reg = (void *)&obj->spi.spi->RXDOUBLE;
        } else if (obj->spi.bits == 9) {
            rx_reg = (void *)&obj->spi.spi->RXDATAX;
        } else {
            rx_reg = (void *)&obj->spi.spi->RXDATA;
        }

        /* Activate RX channel */
        DMA_ActivateBasic(obj->spi.dmaOptionsRX.dmaChannel,
                          true,
                          false,
                          rxdata,
                          rx_reg,
                          rx_length - 1);
    }

    // buffer with all FFs.
    /* Setting up channel descriptor */
    txDescrCfg.dstInc = dmaDataIncNone;
    if (txdata == 0) {
        // Don't increment source when there is no transmit buffer
        txDescrCfg.srcInc = dmaDataIncNone;
    } else {
        if (obj->tx_buff.width == 32) {
            txDescrCfg.srcInc = dmaDataInc4;
        } else if (obj->tx_buff.width == 16) {
            txDescrCfg.srcInc = dmaDataInc2;
        } else {
            txDescrCfg.srcInc = dmaDataInc1;
        }
    }
    txDescrCfg.size = (obj->spi.bits <= 8 ? dmaDataSize1 : dmaDataSize2); //When frame size >= 9, use TXDOUBLE
    txDescrCfg.arbRate = dmaArbitrate1;
    txDescrCfg.hprot = 0;
    DMA_CfgDescr(obj->spi.dmaOptionsTX.dmaChannel, true, &txDescrCfg);

    void * tx_reg;
    if (obj->spi.bits > 9) {
        tx_reg = (void *)&obj->spi.spi->TXDOUBLE;
    } else if (obj->spi.bits == 9) {
        tx_reg = (void *)&obj->spi.spi->TXDATAX;
    } else {
        tx_reg = (void *)&obj->spi.spi->TXDATA;
    }

    /* Activate TX channel */
    DMA_ActivateBasic(obj->spi.dmaOptionsTX.dmaChannel,
                      true,
                      false,
                      tx_reg,
                      (txdata == 0 ? &fill_word : (void *)txdata), // When there is nothing to transmit, point to static fill word
                      (tx_length - 1));
}
#endif //LDMA_PRESENT
/********************************************************************
* spi_master_transfer_dma(spi_t *obj, void *rxdata, void *txdata, int length, DMACallback cb, DMAUsage hint)
*
* Start an SPI transfer by using DMA and the supplied hint for DMA useage
*
*   * obj: pointer to specific SPI instance
*   * rxdata: pointer to rx buffer. If null, we will assume only TX is relevant, and RX will be ignored.
*   * txdata: pointer to TX buffer. If null, we will assume only the read is relevant, and will send FF's for reading back.
*   * length: How many bytes should be written/read.
*   * cb: thunk pointer into CPP-land to get the spi object
*   * hint: hint for the requested DMA useage.
*       * NEVER: do not use DMA, but use IRQ instead
*       * OPPORTUNISTIC: use DMA if there are channels available, but return them after the transfer.
*       * ALWAYS: use DMA if channels are available, and hold on to the channels after the transfer.
*                 If the previous transfer has kept the channel, that channel will continue to get used.
*
********************************************************************/
void spi_master_transfer_dma(spi_t *obj, const void *txdata, void *rxdata, int tx_length, int rx_length, void* cb, DMAUsage hint)
{
    /* Init DMA here to include it in the power figure */
    dma_init();
    /* Clear TX and RX registers */
    obj->spi.spi->CMD = USART_CMD_CLEARTX;
    obj->spi.spi->CMD = USART_CMD_CLEARRX;
    /* If the DMA channels are already allocated, we can assume they have been setup already */
    if (hint != DMA_USAGE_NEVER && obj->spi.dmaOptionsTX.dmaUsageState == DMA_USAGE_ALLOCATED) {
        /* setup has already been done, so just activate the transfer */
        spi_activate_dma(obj, rxdata, txdata, tx_length, rx_length);
    } else if (hint == DMA_USAGE_NEVER) {
        /* use IRQ */
        obj->spi.spi->IFC = 0xFFFFFFFF;
        spi_master_write_asynch(obj);
        spi_enable_interrupt(obj, (uint32_t)cb, true);
    } else {
        /* try to acquire channels */
        dma_init();
        spi_enable_dma(obj, hint);

        /* decide between DMA and IRQ */
        if (obj->spi.dmaOptionsTX.dmaUsageState == DMA_USAGE_ALLOCATED || obj->spi.dmaOptionsTX.dmaUsageState == DMA_USAGE_TEMPORARY_ALLOCATED) {
            /* disable the interrupts that may have been left open previously */
            spi_enable_interrupt(obj, (uint32_t)cb, false);

            /* DMA channels are allocated, so do their setup */
            spi_master_dma_channel_setup(obj, cb);
            /* and activate the transfer */
            spi_activate_dma(obj, rxdata, txdata, tx_length, rx_length);
        } else {
            /* DMA is unavailable, so fall back to IRQ */
            obj->spi.spi->IFC = 0xFFFFFFFF;
            spi_master_write_asynch(obj);
            spi_enable_interrupt(obj, (uint32_t)cb, true);
        }
    }
}

/** Begin the SPI transfer. Buffer pointers and lengths are specified in tx_buff and rx_buff
 *
 * @param[in] obj     The SPI object which holds the transfer information
 * @param[in] tx        The buffer to send
 * @param[in] tx_length The number of words to transmit
 * @param[in] rx        The buffer to receive
 * @param[in] rx_length The number of words to receive
 * @param[in] bit_width The bit width of buffer words
 * @param[in] event     The logical OR of events to be registered
 * @param[in] handler   SPI interrupt handler
 * @param[in] hint      A suggestion for how to use DMA with this transfer
 */
void spi_master_transfer(spi_t *obj, const void *tx, size_t tx_length, void *rx, size_t rx_length, uint8_t bit_width, uint32_t handler, uint32_t event, DMAUsage hint)
{
    if( spi_active(obj) ) return;

    /* update fill word if on 9-bit frame size */
    if(obj->spi.bits == 9) fill_word = SPI_FILL_WORD & 0x1FF;
    else fill_word = SPI_FILL_WORD;

    /* check corner case */
    if(tx_length == 0) {
        tx_length = rx_length;
        tx = (void*) 0;
    }

    /* First, set the buffer */
    spi_buffer_set(obj, tx, tx_length, rx, rx_length, bit_width);

